# импорт либы datetime для работы с датами
from datetime import date

# ввод данных
day = int(input("День: "))
month = int(input("Месяц: "))
year = int(input("Год: "))

# today - это объект хранящий в себе текущий месяц день год и так далее
today = date.today()
# сперва мы вычтем из текущего года год который ввел пользователь
# а далее сравниваем сперва месяц и день, и если они оба меньше, то у нас еще вычтется один год
age = today.year - year - ((today.month, today.day) < (month, day))

# выводим получившийся возраст
print("Возраст:", age)

